overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Overview</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 12:56:55 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Overview of Pallet"/>
<meta name="keywords" content="pallet clojure provisioning configuration automation"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Overview</h1>

<p>What makes pallet different to some of the other tools out there?
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Features </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">No Dependencies </h3>
<div class="outline-text-3" id="text-1_1">


<p>
The machines being managed require no special dependencies to be installed. As
long as they have bash and ssh running, they can be used with pallet.  For me
this was important - it means that you can use pretty much any image out there,
which is great for ad-hoc testing and development.
</p>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">No Server </h3>
<div class="outline-text-3" id="text-1_2">


<p>
Pallet has no central server to set up and maintain - it simply runs on
demand. You can run it from anywhere, even over a remote REPL connection.
</p>
</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3">Everything in Version Control </h3>
<div class="outline-text-3" id="text-1_3">


<p>
In pallet, all your configuration is handled in SCM controlled files - there is
no database involved.  This means that your configuration can always be kept in
step with the development of your crates, and the versions of the external
crates that you use.
</p>
</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4">Jar File Distribution of Crates </h3>
<div class="outline-text-3" id="text-1_4">


<p>
Custom crates can be distributed as jar files, and so can be published in maven
repositories, and be consumed in a version controlled manner.  Hopefully this
will promote shared crates.
</p>
</div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5">Provisioning, Configuration and Administration </h3>
<div class="outline-text-3" id="text-1_5">


<p>
Pallet aims quite wide. You can use it for starting an stopping nodes, for
configuring nodes, deploying projects and also for running administration tasks.
To be honest, this wasn't an initial design goal, but has come out of the wash
that way.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">How it works </h2>
<div class="outline-text-2" id="text-2">


<p>
Pallet is written in <a href="http://clojure.org">Clojure</a>, and so runs in a JVM.  You can embed it in any JVM
based project, or use it directly at the REPL.
</p>
<p>
Pallet <a href="reference/reference_providers.html">talks to a cloud provider</a>, in order to start up new nodes, etc.  It does
this using the excellent <a href="http://jclouds.org">jclouds</a> library.  Once the nodes are running,
Pallet uses SSH to <a href="reference/reference_node_push.html">communicate with the nodes</a>.
</p>
<p>
To execute actions on the nodes, pallet executes shell scripts.  These scripts
are generated in <a href="http://clojure.org">Clojure</a>.  At the lowest level, Pallet <a href="reference/reference_script.html">embeds shell script</a>
in <a href="http://clojure.org">Clojure</a>, and wraps shell script fragments into <a href="http://clojure.org">Clojure</a> functions,
creating reusable resources.
</p>
<p>
Of course, no two operating systems are identical, so Pallet allows dispatching
of the functions based on packager, etc, enabling abstraction of a node's
operating system.
</p>
<p>
Higher level <a href="reference/reference_crates.html">crates</a> are then put together, that use the resources to install
packages, etc. Crates can also be implemented using the same machinery as
resource functions.
</p>
<p>
<a href="reference/reference_node_types.html">Node types</a> are defined that specify a tag and the sequence of crates to apply
for each of a number of phases. By default, pallet defines <code>:bootstrap</code> and
<code>:configure</code> phases, but you can add as many phases as you like
(e.g. <code>:backup</code>).
</p>

<p>
<a href="reference/reference_phases.html">Phases</a> are executed using either the <a href="reference/reference_operations.html"><code>converge</code> or <code>lift</code> commands</a>, with
<code>converge</code> also adjusting the number of nodes running for each tag.
</p>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Related Projects </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-4">
<h4 id="sec-3_1">Configuration </h4>
<div class="outline-text-4" id="text-3_1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Project Name</th><th scope="col" class="left">Link</th></tr>
</thead>
<tbody>
<tr><td class="left">Chef</td><td class="left"><a href="http://wiki.opscode.com/display/chef/Home">http://wiki.opscode.com/display/chef/Home</a></td></tr>
<tr><td class="left">Puppet</td><td class="left"><a href="http://www.puppetlabs.com/">http://www.puppetlabs.com/</a></td></tr>
<tr><td class="left">cfengine</td><td class="left"><a href="http://www.cfengine.org">http://www.cfengine.org</a></td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3_2" class="outline-4">
<h4 id="sec-3_2">Node Provisioning </h4>
<div class="outline-text-4" id="text-3_2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Project Name</th><th scope="col" class="left">Link</th></tr>
</thead>
<tbody>
<tr><td class="left">jClouds</td><td class="left"><a href="http://www.jclouds.org/ ">http://www.jclouds.org/ </a></td></tr>
<tr><td class="left">fog</td><td class="left"><a href="http://github.com/geemus/fog">http://github.com/geemus/fog</a></td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3_3" class="outline-4">
<h4 id="sec-3_3">Application Services </h4>
<div class="outline-text-4" id="text-3_3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Project Name</th><th scope="col" class="left">Link</th></tr>
</thead>
<tbody>
<tr><td class="left">Capistrano</td><td class="left"></td></tr>
<tr><td class="left">Fabric</td><td class="left"></td></tr>
<tr><td class="left">Func</td><td class="left"></td></tr>
</tbody>
</table>



<p>
If you have a project that you would like included above, I'll be happy to add it.
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-21 12:56:55 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
